# IsNonSolid Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ExternallyTaggedGeometryValidation..::..IsNonSolid Method
ExternallyTaggedGeometryValidation Class See Also
---
Makes sure that the input geometry object is not a Solid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static bool IsNonSolid(
	GeometryObject geometry
)
```

Visual Basic
---
```text
Public Shared Function IsNonSolid ( _
	geometry As GeometryObject _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsNonSolid(
	GeometryObject^ geometry
)
```

# ### Parameters
geometry
    Type: Autodesk.Revit.DB..::..GeometryObject Geometry object to be validated.
# ### Return Value
True if the supplied geometry object is not a Solid.
# See Also
ExternallyTaggedGeometryValidation Class
Autodesk.Revit.DB Namespace